------ MODULE arith19_test ------

(*****************************************************************************)
(* Name: arith19_test                                                        *)
(* Author: Antoine Defourné                                                  *)
(* Date: 25/09/19                                                            *)
(*****************************************************************************)

EXTENDS Integers, TLAPS

THEOREM 6 \notin 1 .. 4
    OBVIOUS

====

