------ MODULE arith4_test ------

(*****************************************************************************)
(* Name: arith4_test                                                         *)
(* Author: Antoine Defourné                                                  *)
(* Date: 01/07/19                                                            *)
(*****************************************************************************)

EXTENDS Integers, TLAPS

THEOREM 4 \div 2 = 2
    OBVIOUS

====

